Autodesk.Revit.DB.SolidOrShellTessellationControls.MinAngleInTriangle
A positive real number specifying the minimum allowed angle for any triangle in the triangulation, in radians.
Remarks:
A small value can be useful when triangulating long, thin objects, in order to keep the number of triangles
small, but it can result in long, thin triangles, which are not acceptable for all applications. If the value
is too large, this constraint may not be satisfiable, causing the triangulation to fail. This constraint may be
approximately enforced.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minAngleInTriangle must lie between 0 and 60 degrees (exclusive), expressed in radians.
Since:
2013